Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/sha.h
/* -------- SHA_IDR : (SHA Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define SHA_IDR_DATRDY_Pos                    _U_(0)                                               /**< (SHA_IDR) Data Ready Interrupt Disable Position */
#define SHA_IDR_DATRDY_Msk                    (_U_(0x1) << SHA_IDR_DATRDY_Pos)                     /**< (SHA_IDR) Data Ready Interrupt Disable Mask */
#define SHA_IDR_DATRDY(value)                 (SHA_IDR_DATRDY_Msk & ((value) << SHA_IDR_DATRDY_Pos))
#define SHA_IDR_URAD_Pos                      _U_(8)                                               /**< (SHA_IDR) Unspecified Register Access Detection Interrupt Disable Position */
#define SHA_IDR_URAD_Msk                      (_U_(0x1) << SHA_IDR_URAD_Pos)                       /**< (SHA_IDR) Unspecified Register Access Detection Interrupt Disable Mask */
#define SHA_IDR_URAD(value)                   (SHA_IDR_URAD_Msk & ((value) << SHA_IDR_URAD_Pos))  
#define SHA_IDR_CHECKF_Pos                    _U_(16)                                              /**< (SHA_IDR) Check Done Interrupt Disable Position */
#define SHA_IDR_CHECKF_Msk                    (_U_(0x1) << SHA_IDR_CHECKF_Pos)                     /**< (SHA_IDR) Check Done Interrupt Disable Mask */
#define SHA_IDR_CHECKF(value)                 (SHA_IDR_CHECKF_Msk & ((value) << SHA_IDR_CHECKF_Pos))
#define SHA_IDR_SECE_Pos                      _U_(24)                                              /**< (SHA_IDR) Safety Event Interrupt Disable Position */
#define SHA_IDR_SECE_Msk                      (_U_(0x1) << SHA_IDR_SECE_Pos)                       /**< (SHA_IDR) Safety Event Interrupt Disable Mask */
#define SHA_IDR_SECE(value)                   (SHA_IDR_SECE_Msk & ((value) << SHA_IDR_SECE_Pos))  
#define SHA_IDR_Msk                           _U_(0x01010101)                                      /**< (SHA_IDR) Register Mask  */


/* -------- SHA_IMR : (SHA Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define SHA_IMR_DATRDY_Pos                    _U_(0)                                               /**< (SHA_IMR) Data Ready Interrupt Mask Position */
#define SHA_IMR_DATRDY_Msk                    (_U_(0x1) << SHA_IMR_DATRDY_Pos)                     /**< (SHA_IMR) Data Ready Interrupt Mask Mask */
#define SHA_IMR_DATRDY(value)                 (SHA_IMR_DATRDY_Msk & ((value) << SHA_IMR_DATRDY_Pos))
#define SHA_IMR_URAD_Pos                      _U_(8)                                               /**< (SHA_IMR) Unspecified Register Access Detection Interrupt Mask Position */
#define SHA_IMR_URAD_Msk                      (_U_(0x1) << SHA_IMR_URAD_Pos)                       /**< (SHA_IMR) Unspecified Register Access Detection Interrupt Mask Mask */
#define SHA_IMR_URAD(value)                   (SHA_IMR_URAD_Msk & ((value) << SHA_IMR_URAD_Pos))  
#define SHA_IMR_CHECKF_Pos                    _U_(16)                                              /**< (SHA_IMR) Check Done Interrupt Mask Position */
#define SHA_IMR_CHECKF_Msk                    (_U_(0x1) << SHA_IMR_CHECKF_Pos)                     /**< (SHA_IMR) Check Done Interrupt Mask Mask */
#define SHA_IMR_CHECKF(value)                 (SHA_IMR_CHECKF_Msk & ((value) << SHA_IMR_CHECKF_Pos))
#define SHA_IMR_SECE_Pos                      _U_(24)                                              /**< (SHA_IMR) Safety Event Interrupt Mask Position */
#define SHA_IMR_SECE_Msk                      (_U_(0x1) << SHA_IMR_SECE_Pos)                       /**< (SHA_IMR) Safety Event Interrupt Mask Mask */
#define SHA_IMR_SECE(value)                   (SHA_IMR_SECE_Msk & ((value) << SHA_IMR_SECE_Pos))  
#define SHA_IMR_Msk                           _U_(0x01010101)                                      /**< (SHA_IMR) Register Mask  */


/* -------- SHA_ISR : (SHA Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define SHA_ISR_DATRDY_Pos                    _U_(0)                                               /**< (SHA_ISR) Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx) Position */
#define SHA_ISR_DATRDY_Msk                    (_U_(0x1) << SHA_ISR_DATRDY_Pos)                     /**< (SHA_ISR) Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx) Mask */
#define SHA_ISR_DATRDY(value)                 (SHA_ISR_DATRDY_Msk & ((value) << SHA_ISR_DATRDY_Pos))
#define SHA_ISR_WRDY_Pos                      _U_(4)                                               /**< (SHA_ISR) Input Data Register Write Ready Position */
#define SHA_ISR_WRDY_Msk                      (_U_(0x1) << SHA_ISR_WRDY_Pos)                       /**< (SHA_ISR) Input Data Register Write Ready Mask */
#define SHA_ISR_WRDY(value)                   (SHA_ISR_WRDY_Msk & ((value) << SHA_ISR_WRDY_Pos))  
#define SHA_ISR_URAD_Pos                      _U_(8)                                               /**< (SHA_ISR) Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR) Position */
#define SHA_ISR_URAD_Msk                      (_U_(0x1) << SHA_ISR_URAD_Pos)                       /**< (SHA_ISR) Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR) Mask */
#define SHA_ISR_URAD(value)                   (SHA_ISR_URAD_Msk & ((value) << SHA_ISR_URAD_Pos))  
#define SHA_ISR_URAT_Pos                      _U_(12)                                              /**< (SHA_ISR) Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR) Position */
#define SHA_ISR_URAT_Msk                      (_U_(0x7) << SHA_ISR_URAT_Pos)                       /**< (SHA_ISR) Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR) Mask */
#define SHA_ISR_URAT(value)                   (SHA_ISR_URAT_Msk & ((value) << SHA_ISR_URAT_Pos))  
#define SHA_ISR_CHECKF_Pos                    _U_(16)                                              /**< (SHA_ISR) Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx) Position */
#define SHA_ISR_CHECKF_Msk                    (_U_(0x1) << SHA_ISR_CHECKF_Pos)                     /**< (SHA_ISR) Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx) Mask */
#define SHA_ISR_CHECKF(value)                 (SHA_ISR_CHECKF_Msk & ((value) << SHA_ISR_CHECKF_Pos))
#define SHA_ISR_CHKST_Pos                     _U_(20)                                              /**< (SHA_ISR) Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx) Position */
#define SHA_ISR_CHKST_Msk                     (_U_(0xF) << SHA_ISR_CHKST_Pos)                      /**< (SHA_ISR) Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx) Mask */
#define SHA_ISR_CHKST(value)                  (SHA_ISR_CHKST_Msk & ((value) << SHA_ISR_CHKST_Pos))
#define SHA_ISR_SECE_Pos                      _U_(24)                                              /**< (SHA_ISR) Security and/or Safety Event Position */
#define SHA_ISR_SECE_Msk                      (_U_(0x1) << SHA_ISR_SECE_Pos)                       /**< (SHA_ISR) Security and/or Safety Event Mask */
#define SHA_ISR_SECE(value)                   (SHA_ISR_SECE_Msk & ((value) << SHA_ISR_SECE_Pos))  
#define SHA_ISR_Msk                           _U_(0x01F17111)                                      /**< (SHA_ISR) Register Mask  */


/* -------- SHA_MSR : (SHA Offset: 0x20) (R/W 32) Message Size Register -------- */
#define SHA_MSR_MSGSIZE_Pos                   _U_(0)                                               /**< (SHA_MSR) Message Size Position */
#define SHA_MSR_MSGSIZE_Msk                   (_U_(0xFFFFFFFF) << SHA_MSR_MSGSIZE_Pos)             /**< (SHA_MSR) Message Size Mask */
#define SHA_MSR_MSGSIZE(value)                (SHA_MSR_MSGSIZE_Msk & ((value) << SHA_MSR_MSGSIZE_Pos))
#define SHA_MSR_Msk                           _U_(0xFFFFFFFF)                                      /**< (SHA_MSR) Register Mask  */


/* -------- SHA_BCR : (SHA Offset: 0x30) (R/W 32) Bytes Count Register -------- */
#define SHA_BCR_BYTCNT_Pos                    _U_(0)                                               /**< (SHA_BCR) Remaining Byte Count Before Auto Padding Position */
#define SHA_BCR_BYTCNT_Msk                    (_U_(0xFFFFFFFF) << SHA_BCR_BYTCNT_Pos)              /**< (SHA_BCR) Remaining Byte Count Before Auto Padding Mask */
#define SHA_BCR_BYTCNT(value)                 (SHA_BCR_BYTCNT_Msk & ((value) << SHA_BCR_BYTCNT_Pos))
#define SHA_BCR_Msk                           _U_(0xFFFFFFFF)                                      /**< (SHA_BCR) Register Mask  */


/* -------- SHA_IDATAR0 : (SHA Offset: 0x40) ( /W 32) Input Data 0 Register 0 -------- */
#define SHA_IDATAR0_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR0) Input Data Position */
#define SHA_IDATAR0_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR0_IDATA_Pos)           /**< (SHA_IDATAR0) Input Data Mask */
#define SHA_IDATAR0_IDATA(value)              (SHA_IDATAR0_IDATA_Msk & ((value) << SHA_IDATAR0_IDATA_Pos))
#define SHA_IDATAR0_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR0) Register Mask  */


/* -------- SHA_IDATAR1 : (SHA Offset: 0x44) ( /W 32) Input Data 0 Register 1 -------- */
#define SHA_IDATAR1_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR1) Input Data Position */
#define SHA_IDATAR1_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR1_IDATA_Pos)           /**< (SHA_IDATAR1) Input Data Mask */
#define SHA_IDATAR1_IDATA(value)              (SHA_IDATAR1_IDATA_Msk & ((value) << SHA_IDATAR1_IDATA_Pos))
#define SHA_IDATAR1_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR1) Register Mask  */


/* -------- SHA_IDATAR2 : (SHA Offset: 0x48) ( /W 32) Input Data 0 Register 2 -------- */
#define SHA_IDATAR2_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR2) Input Data Position */
#define SHA_IDATAR2_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR2_IDATA_Pos)           /**< (SHA_IDATAR2) Input Data Mask */
#define SHA_IDATAR2_IDATA(value)              (SHA_IDATAR2_IDATA_Msk & ((value) << SHA_IDATAR2_IDATA_Pos))
#define SHA_IDATAR2_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR2) Register Mask  */


