Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/sha.h
/* -------- SHA_IDATAR3 : (SHA Offset: 0x4C) ( /W 32) Input Data 0 Register 3 -------- */
#define SHA_IDATAR3_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR3) Input Data Position */
#define SHA_IDATAR3_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR3_IDATA_Pos)           /**< (SHA_IDATAR3) Input Data Mask */
#define SHA_IDATAR3_IDATA(value)              (SHA_IDATAR3_IDATA_Msk & ((value) << SHA_IDATAR3_IDATA_Pos))
#define SHA_IDATAR3_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR3) Register Mask  */


/* -------- SHA_IDATAR4 : (SHA Offset: 0x50) ( /W 32) Input Data 0 Register 4 -------- */
#define SHA_IDATAR4_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR4) Input Data Position */
#define SHA_IDATAR4_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR4_IDATA_Pos)           /**< (SHA_IDATAR4) Input Data Mask */
#define SHA_IDATAR4_IDATA(value)              (SHA_IDATAR4_IDATA_Msk & ((value) << SHA_IDATAR4_IDATA_Pos))
#define SHA_IDATAR4_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR4) Register Mask  */


/* -------- SHA_IDATAR5 : (SHA Offset: 0x54) ( /W 32) Input Data 0 Register 5 -------- */
#define SHA_IDATAR5_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR5) Input Data Position */
#define SHA_IDATAR5_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR5_IDATA_Pos)           /**< (SHA_IDATAR5) Input Data Mask */
#define SHA_IDATAR5_IDATA(value)              (SHA_IDATAR5_IDATA_Msk & ((value) << SHA_IDATAR5_IDATA_Pos))
#define SHA_IDATAR5_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR5) Register Mask  */


/* -------- SHA_IDATAR6 : (SHA Offset: 0x58) ( /W 32) Input Data 0 Register 6 -------- */
#define SHA_IDATAR6_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR6) Input Data Position */
#define SHA_IDATAR6_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR6_IDATA_Pos)           /**< (SHA_IDATAR6) Input Data Mask */
#define SHA_IDATAR6_IDATA(value)              (SHA_IDATAR6_IDATA_Msk & ((value) << SHA_IDATAR6_IDATA_Pos))
#define SHA_IDATAR6_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR6) Register Mask  */


/* -------- SHA_IDATAR7 : (SHA Offset: 0x5C) ( /W 32) Input Data 0 Register 7 -------- */
#define SHA_IDATAR7_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR7) Input Data Position */
#define SHA_IDATAR7_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR7_IDATA_Pos)           /**< (SHA_IDATAR7) Input Data Mask */
#define SHA_IDATAR7_IDATA(value)              (SHA_IDATAR7_IDATA_Msk & ((value) << SHA_IDATAR7_IDATA_Pos))
#define SHA_IDATAR7_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR7) Register Mask  */


/* -------- SHA_IDATAR8 : (SHA Offset: 0x60) ( /W 32) Input Data 0 Register 8 -------- */
#define SHA_IDATAR8_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR8) Input Data Position */
#define SHA_IDATAR8_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR8_IDATA_Pos)           /**< (SHA_IDATAR8) Input Data Mask */
#define SHA_IDATAR8_IDATA(value)              (SHA_IDATAR8_IDATA_Msk & ((value) << SHA_IDATAR8_IDATA_Pos))
#define SHA_IDATAR8_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR8) Register Mask  */


/* -------- SHA_IDATAR9 : (SHA Offset: 0x64) ( /W 32) Input Data 0 Register 9 -------- */
#define SHA_IDATAR9_IDATA_Pos                 _U_(0)                                               /**< (SHA_IDATAR9) Input Data Position */
#define SHA_IDATAR9_IDATA_Msk                 (_U_(0xFFFFFFFF) << SHA_IDATAR9_IDATA_Pos)           /**< (SHA_IDATAR9) Input Data Mask */
#define SHA_IDATAR9_IDATA(value)              (SHA_IDATAR9_IDATA_Msk & ((value) << SHA_IDATAR9_IDATA_Pos))
#define SHA_IDATAR9_Msk                       _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR9) Register Mask  */


/* -------- SHA_IDATAR10 : (SHA Offset: 0x68) ( /W 32) Input Data 0 Register 10 -------- */
#define SHA_IDATAR10_IDATA_Pos                _U_(0)                                               /**< (SHA_IDATAR10) Input Data Position */
#define SHA_IDATAR10_IDATA_Msk                (_U_(0xFFFFFFFF) << SHA_IDATAR10_IDATA_Pos)          /**< (SHA_IDATAR10) Input Data Mask */
#define SHA_IDATAR10_IDATA(value)             (SHA_IDATAR10_IDATA_Msk & ((value) << SHA_IDATAR10_IDATA_Pos))
#define SHA_IDATAR10_Msk                      _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR10) Register Mask  */


/* -------- SHA_IDATAR11 : (SHA Offset: 0x6C) ( /W 32) Input Data 0 Register 11 -------- */
#define SHA_IDATAR11_IDATA_Pos                _U_(0)                                               /**< (SHA_IDATAR11) Input Data Position */
#define SHA_IDATAR11_IDATA_Msk                (_U_(0xFFFFFFFF) << SHA_IDATAR11_IDATA_Pos)          /**< (SHA_IDATAR11) Input Data Mask */
#define SHA_IDATAR11_IDATA(value)             (SHA_IDATAR11_IDATA_Msk & ((value) << SHA_IDATAR11_IDATA_Pos))
#define SHA_IDATAR11_Msk                      _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR11) Register Mask  */


/* -------- SHA_IDATAR12 : (SHA Offset: 0x70) ( /W 32) Input Data 0 Register 12 -------- */
#define SHA_IDATAR12_IDATA_Pos                _U_(0)                                               /**< (SHA_IDATAR12) Input Data Position */
#define SHA_IDATAR12_IDATA_Msk                (_U_(0xFFFFFFFF) << SHA_IDATAR12_IDATA_Pos)          /**< (SHA_IDATAR12) Input Data Mask */
#define SHA_IDATAR12_IDATA(value)             (SHA_IDATAR12_IDATA_Msk & ((value) << SHA_IDATAR12_IDATA_Pos))
#define SHA_IDATAR12_Msk                      _U_(0xFFFFFFFF)                                      /**< (SHA_IDATAR12) Register Mask  */


