Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/sha.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SHA register API structure */
typedef struct
{
  __O   uint32_t                       SHA_CR;             /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SHA_MR;             /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint8_t                        Reserved1[0x08];
  __O   uint32_t                       SHA_IER;            /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SHA_IDR;            /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SHA_IMR;            /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   uint32_t                       SHA_ISR;            /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __IO  uint32_t                       SHA_MSR;            /**< Offset: 0x20 (R/W  32) Message Size Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       SHA_BCR;            /**< Offset: 0x30 (R/W  32) Bytes Count Register */
  __I   uint8_t                        Reserved3[0x0C];
  __O   uint32_t                       SHA_IDATAR0;        /**< Offset: 0x40 ( /W  32) Input Data 0 Register 0 */
  __O   uint32_t                       SHA_IDATAR1;        /**< Offset: 0x44 ( /W  32) Input Data 0 Register 1 */
  __O   uint32_t                       SHA_IDATAR2;        /**< Offset: 0x48 ( /W  32) Input Data 0 Register 2 */
  __O   uint32_t                       SHA_IDATAR3;        /**< Offset: 0x4C ( /W  32) Input Data 0 Register 3 */
  __O   uint32_t                       SHA_IDATAR4;        /**< Offset: 0x50 ( /W  32) Input Data 0 Register 4 */
  __O   uint32_t                       SHA_IDATAR5;        /**< Offset: 0x54 ( /W  32) Input Data 0 Register 5 */
  __O   uint32_t                       SHA_IDATAR6;        /**< Offset: 0x58 ( /W  32) Input Data 0 Register 6 */
  __O   uint32_t                       SHA_IDATAR7;        /**< Offset: 0x5C ( /W  32) Input Data 0 Register 7 */
  __O   uint32_t                       SHA_IDATAR8;        /**< Offset: 0x60 ( /W  32) Input Data 0 Register 8 */
  __O   uint32_t                       SHA_IDATAR9;        /**< Offset: 0x64 ( /W  32) Input Data 0 Register 9 */
  __O   uint32_t                       SHA_IDATAR10;       /**< Offset: 0x68 ( /W  32) Input Data 0 Register 10 */
  __O   uint32_t                       SHA_IDATAR11;       /**< Offset: 0x6C ( /W  32) Input Data 0 Register 11 */
  __O   uint32_t                       SHA_IDATAR12;       /**< Offset: 0x70 ( /W  32) Input Data 0 Register 12 */
  __O   uint32_t                       SHA_IDATAR13;       /**< Offset: 0x74 ( /W  32) Input Data 0 Register 13 */
  __O   uint32_t                       SHA_IDATAR14;       /**< Offset: 0x78 ( /W  32) Input Data 0 Register 14 */
  __O   uint32_t                       SHA_IDATAR15;       /**< Offset: 0x7C ( /W  32) Input Data 0 Register 15 */
  __IO  uint32_t                       SHA_IODATAR0;       /**< Offset: 0x80 (R/W  32) Input/Output Data 0 Register 0 */
  __IO  uint32_t                       SHA_IODATAR1;       /**< Offset: 0x84 (R/W  32) Input/Output Data 0 Register 1 */
  __IO  uint32_t                       SHA_IODATAR2;       /**< Offset: 0x88 (R/W  32) Input/Output Data 0 Register 2 */
  __IO  uint32_t                       SHA_IODATAR3;       /**< Offset: 0x8C (R/W  32) Input/Output Data 0 Register 3 */
  __IO  uint32_t                       SHA_IODATAR4;       /**< Offset: 0x90 (R/W  32) Input/Output Data 0 Register 4 */
  __IO  uint32_t                       SHA_IODATAR5;       /**< Offset: 0x94 (R/W  32) Input/Output Data 0 Register 5 */
  __IO  uint32_t                       SHA_IODATAR6;       /**< Offset: 0x98 (R/W  32) Input/Output Data 0 Register 6 */
  __IO  uint32_t                       SHA_IODATAR7;       /**< Offset: 0x9C (R/W  32) Input/Output Data 0 Register 7 */
  __IO  uint32_t                       SHA_IODATAR8;       /**< Offset: 0xA0 (R/W  32) Input/Output Data 0 Register 8 */
  __IO  uint32_t                       SHA_IODATAR9;       /**< Offset: 0xA4 (R/W  32) Input/Output Data 0 Register 9 */
  __IO  uint32_t                       SHA_IODATAR10;      /**< Offset: 0xA8 (R/W  32) Input/Output Data 0 Register 10 */
  __IO  uint32_t                       SHA_IODATAR11;      /**< Offset: 0xAC (R/W  32) Input/Output Data 0 Register 11 */
  __IO  uint32_t                       SHA_IODATAR12;      /**< Offset: 0xB0 (R/W  32) Input/Output Data 0 Register 12 */
  __IO  uint32_t                       SHA_IODATAR13;      /**< Offset: 0xB4 (R/W  32) Input/Output Data 0 Register 13 */
  __IO  uint32_t                       SHA_IODATAR14;      /**< Offset: 0xB8 (R/W  32) Input/Output Data 0 Register 14 */
  __IO  uint32_t                       SHA_IODATAR15;      /**< Offset: 0xBC (R/W  32) Input/Output Data 0 Register 15 */
  __I   uint8_t                        Reserved4[0x24];
  __IO  uint32_t                       SHA_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SHA_WPSR;           /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} sha_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH71_SHA_COMPONENT_H_ */
